a: float = float(input("Введите длину стороны a: "))
b: float = float(input("Введите длину стороны b: "))
c: float = float(input("Введите длину стороны c: "))

if a <= 0 or b <= 0 or c <= 0:
    print("Ошибка: Длины сторон должны быть строго больше нуля!")                 #проверка на дурака
elif (a + b <= c) or (a + c <= b) or (b + c <= a):
    print("Результат: Такого треугольника не существует.")
    print("Почему: Сумма любых двух сторон должна быть больше третьей стороны.")  #существование треугольника
else:
    print("Результат: Треугольник существует.")
    
if a == b == c:
    print("Треугольник: Равносторонний")
elif a == b or b == c or a == c:
    print("Треугольник: Равнобедренный")
else:
    print("Треугольник: Разносторонний")                                          #тип треугольника


#если что 9 задание